Please read Python for Data Analysis chapter 7 (we are also talking about some information from chapter 5 and chapter 8)

In [1]:
import numpy as np
import pandas as pd

In [10]:
d = {'Country':['FR','DE','US'], '2011':[7000,5800,15000], '2012':[6900,6000,14000], '2013':[7000,6200,13000]}

In [11]:
d

{'Country': ['FR', 'DE', 'US'],
 '2011': [7000, 5800, 15000],
 '2012': [6900, 6000, 14000],
 '2013': [7000, 6200, 13000]}

In [12]:
df = pd.DataFrame(d)

In [13]:
df

  Country   2011   2012   2013
0      FR   7000   6900   7000
1      DE   5800   6000   6200
2      US  15000  14000  13000

In [15]:
pd.melt(df, id_vars=['Country'], value_vars=['2011','2012','2013'], var_name='Year',value_name='n')

  Country  Year      n
0      FR  2011   7000
1      DE  2011   5800
2      US  2011  15000
3      FR  2012   6900
4      DE  2012   6000
5      US  2012  14000
6      FR  2013   7000
7      DE  2013   6200
8      US  2013  13000

In [16]:
d = {'city':['NYC','NYC','LON','LON','BEJ','BEJ'],'part_size':['small','large','small','large','small','large'], 'amount':[23,14,22,16,121,56]}

In [17]:
d

{'city': ['NYC', 'NYC', 'LON', 'LON', 'BEJ', 'BEJ'],
 'part_size': ['small', 'large', 'small', 'large', 'small', 'large'],
 'amount': [23, 14, 22, 16, 121, 56]}

In [18]:
df2 = pd.DataFrame(d)

In [19]:
df2

  city part_size  amount
0  NYC     small      23
1  NYC     large      14
2  LON     small      22
3  LON     large      16
4  BEJ     small     121
5  BEJ     large      56

In [29]:
df2.pivot(index='city', columns = 'part_size', values='amount')

part_size  large  small
city
BEJ           56    121
LON           16     22
NYC           14     23

## Handling Missing Data

Some helpful functions: `.dropna()`, `.fillna()`, `.isnull()`, `.notnull()`

In [30]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

## Groupby

In [36]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)

In [37]:
by_comp = df.groupby("Company")

## Merging

`pd.merge(left, right, how, on)`

Types of merges:

In [38]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [39]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [40]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

## Removing Duplicates

In [46]:
data = pd.DataFrame({'k1':['one','two']*3+['two'], 'k2':[1,1,2,3,3,4,4]})

In [47]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [49]:
data['v1'] = range(7)

In [50]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

## Replacing Values

In [51]:
data = pd.Series([1,-999,2,-999,-3,10])

In [52]:
data

0      1
1   -999
2      2
3   -999
4     -3
5     10
dtype: int64

In [53]:
data.replace(-999,np.nan)

0     1.0
1     NaN
2     2.0
3     NaN
4    -3.0
5    10.0
dtype: float64